<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download latest Rive disk image</string>
	<key>Identifier</key>
	<string>com.github.mujinit.download.Rive</string>
	    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Rive</string>
    </dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://releases.rive.app/macos/latest/Rive.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
        </dict>
        </dict>
    </array>
</dict>
</plist>
